faronov/cc2530-zigbee/tests/test_mac_poll.c
/* SPDX-License-Identifier: BSD-3-Clause
 * Copyright (c) 2026, cc2530-zigbee contributors. See LICENSE.
 * Synthetic source events, real codecs/transmitter/context. No radio mock.
 */
#include "mac_poll.h"
#include "mac_association.h"
#include "cc2530_mmio.h"
#include <stddef.h>
#include <string.h>

#define CHECK(c) do { if (!(c)) { failed((uint16_t)__LINE__); return; } } while (0)
static const MCU_CODE uint8_t response[] = {
    0x73, 0xcc, 0x91, 0x34, 0x12, 1,2,3,4,5,6,7,8,
    0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18, 2,0x78,0x56,0
};
static const MCU_CODE uint8_t response_r22[] = {
    0x33, 0xcc, 0x91, 0x34, 0x12, 1,2,3,4,5,6,7,8, 0x34,0x12,
    0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18, 2,0x78,0x56,0
};
static mac_poll_t poll;
static mac_tx_t tx;
static mac_poll_request_t request;
static mac_poll_event_t event;
static mac_poll_action_t action;
static mac_poll_record_t record;
static mac_tx_event_t source;
static mac_tx_action_t radio_action;
static mac_association_t association;
static mac_association_request_t association_request;
static mac_association_event_t association_event;
static mac_association_record_t association_record;
static mac_header_t header;
static uint8_t bytes[126], ack[3], length, scenario, mode, observation, i, attempt;
static uint16_t failure, grant;
static uint32_t now, origin, checksum;

static void failed(uint16_t line)
{
    if (!failure)
        failure = line;
}

static uint32_t hash(const void *memory, uint16_t size)
{
    const uint8_t * volatile p = memory;
    volatile uint32_t h = 0;
    volatile uint8_t byte;
    while (size--) {
        byte = *p++;
        h = (h * 33u) ^ byte;
    }
    return h;
}

static void tick(void)
{
    CHECK((scenario < 52 ? mac_poll_step(&poll, &tx, now, NULL, &action)
           : mac_poll_step_rx(&poll, &tx, now, NULL, &action, MAC_RX_R22_ASSOCIATION_RESPONSE))
          == MAC_POLL_OK);
}

static void input(uint8_t kind)
{
    event.kind = kind;
    event.epoch = request.epoch;
    event.generation = poll.control.generation;
    event.stamp = now;
    event.token = action.token;
}

static void send(void)
{
    CHECK((scenario < 52 ? mac_poll_step(&poll, &tx, now, &event, &action)
           : mac_poll_step_rx(&poll, &tx, now, &event, &action, MAC_RX_R22_ASSOCIATION_RESPONSE))
          == MAC_POLL_OK);
}

static void setup(void)
{
    memset(&request, 0, sizeof(request));
    request.epoch = 0x10203040UL;
    request.frame_wait = 300; /* Synthetic caller PIB; no claimed default. */
    request.lifetime = 20000;
    request.work = 256;
    if (scenario == 23) request.work = 7;
    request.pan = 0x1234;
    request.channel = (uint8_t)(11u + scenario % 16u);
    request.local_mode = request.coordinator_mode = MAC_ADDRESS_EXTENDED;
    memcpy(request.local, response + 5, 8);
    memcpy(request.coordinator, response + 13, 8);
    if (scenario == 3 || scenario == 36 || scenario == 38 || scenario == 53) {
        request.coordinator_mode = MAC_ADDRESS_SHORT;
        memset(request.coordinator, 0, 8);
        request.coordinator[0] = 0x44; request.coordinator[1] = 0x33;
    }
    if (scenario == 36 || scenario == 37) {
        request.local_mode = MAC_ADDRESS_SHORT;
        memset(request.local, 0, 8);
        request.local[0] = 0x66; request.local[1] = 0x55;
    }
    memset(&event, 0, sizeof(event));
    memset(&source, 0, sizeof(source));
    memset(&record, 0xc7, sizeof(record));
    now = scenario == 35 ? 0xffffff80UL : 100;
    origin = now;
    CHECK(mac_tx_init(&tx, 0xff, now) == MAC_TX_OK);
    CHECK(mac_poll_init(&poll) == MAC_POLL_OK);
    CHECK(mac_poll_start(&poll, &tx, &request, now) == MAC_POLL_OK);
    CHECK(tx.next_dsn == 0xff && tx.generation == 0);
    memset(&association_request, 0, sizeof(association_request));
    association_request.epoch = request.epoch;
    association_request.lifetime = 18000;
    association_request.work_limit = 8;
    association_request.pan_id = request.pan;
    association_request.channel = request.channel;
    association_request.coordinator_mode = request.coordinator_mode;
    memcpy(association_request.coordinator, request.coordinator, 8);
    memcpy(association_request.local, response + 5, 8);
    CHECK(mac_association_init(&association, now) == MAC_ASSOCIATION_OK);
    CHECK(mac_association_start(&association, &association_request, now) == MAC_ASSOCIATION_OK);
    checksum = hash(&poll, sizeof(poll));
    CHECK(mac_poll_take(&poll, &record) == MAC_POLL_STATE);
    CHECK(mac_poll_start(&poll, &tx, &request, now) == MAC_POLL_STATE);
    CHECK(hash(&poll, sizeof(poll)) == checksum);
}

static void prepare(void)
{
    tick();
    CHECK(action.kind == MAC_POLL_ACTION_PREPARE);
    input(MAC_POLL_PREPARED);
    send();
    CHECK(tx.generation == 1 && tx.next_dsn == 0 && tx.frame[2] == 0xff);
    CHECK(tx.frame[tx.length - 1] == 4 && tx.phase == MAC_TX_DRAW);
    CHECK(mac_tx_copy(&tx, bytes, sizeof(bytes), &length) == MAC_TX_OK);
    CHECK(length == poll.control.outgoing_length && bytes[2] == 0xff);
}

static void sent(void)
{
    source.kind = MAC_TX_EVENT_SENT;
    now = tx.at + 24u + 2u * tx.length;
}

/* Exactly one real step per grant, with the exact original source witness.
 * mode1 wrong DSN then success; mode2 no ACK; mode3 busy; mode4 failure.
 */
static void pump(void)
{
    CHECK(poll.control.tx_issued && action.kind == MAC_POLL_ACTION_TX);
    grant = action.token;
    memset(&source, 0, sizeof(source));
    source.generation = tx.generation; source.retry = tx.retries; source.nb = tx.nb;
    if (action.tx_cancel)
        source.kind = MAC_TX_EVENT_CANCEL;
    else if (tx.phase == MAC_TX_DRAW_WAIT) {
        source.kind = MAC_TX_EVENT_RANDOM;
        source.value = 0;
    } else if (tx.phase == MAC_TX_RADIO) {
        if (mode == 4)
            source.kind = MAC_TX_EVENT_FAILURE;
        else if (mode == 3) {
            source.kind = MAC_TX_EVENT_BUSY;
            now = tx.at + 8;
        } else
            sent();
    } else if (tx.phase == MAC_TX_ACK_WAIT) {
        if (mode == 2)
            now = tx.tx_end + MAC_TX_ACK_SYMBOLS;
        else {
            source.kind = MAC_TX_EVENT_ACK;
            now = tx.tx_end + 34;
            ack[0] = scenario == 5 || scenario == 27 ? 0xeau : 0xfau;
            ack[1] = 0xff; /* Ignored on ACK reception, actual codec normalization. */
            ack[2] = tx.frame[2];
            if (mode == 1 && !tx.retries) ack[2]++;
            source.bytes = ack; source.length = 3;
        }
    } else if (tx.phase == MAC_TX_STOPPING) {
        source.kind = MAC_TX_EVENT_QUIESCED;
        if (tx.retry_pending)
            now = tx.tx_end + MAC_TX_ACK_SYMBOLS;
        /* Old operation truly retired; independent prepared RX lease persists. */
    }
    source.stamp = now;
    input(MAC_POLL_TX);
    event.token = grant;
    event.crc_valid = 1;
    event.source = source;
    event.tx_result = (uint8_t)mac_tx_step(&tx, now, source.kind ? &source : NULL, &radio_action);
    if ((scenario == 44 || scenario == 45) && tx.outcome == MAC_TX_ACKED
            && poll.control.tx_phase == MAC_TX_ACK_WAIT) {
        if (scenario == 44) event.source.stamp++;
        else event.crc_valid = 0;
    }
    send();
}

static void request_ack(void)
{
    prepare();
    attempt = 0;
    while (poll.control.phase == MAC_POLL_REQUEST && !failure && attempt++ < 100)
        pump();
    CHECK(attempt < 100);
}

static void make_data(uint8_t payload_size)
{
    memset(&header, 0, sizeof(header));
    header.type = MAC_FRAME_DATA;
    header.flags = MAC_FLAG_PAN_COMPRESSION | MAC_FLAG_ACK_REQUEST | MAC_FLAG_PENDING;
    header.source_pan = header.destination_pan = request.pan;
    header.source_mode = request.coordinator_mode;
    header.destination_mode = request.local_mode;
    header.sequence = 0x42; /* NOT Request DSN. */
    memcpy(header.source, request.coordinator, 8);
    memcpy(header.destination, request.local, 8);
    /* Header is disjoint; tiny payload is in separate storage. */
    memset(ack, 0x9a, sizeof(ack));
    CHECK(mac_frame_encode(&header, ack, payload_size, bytes, sizeof(bytes), &length) == MAC_CODEC_OK);
}

