faronov/cc2530-zigbee/tests/test_mac_poll.c
static void frame_event(void)
{
    input(MAC_POLL_FRAME);
    event.serial = poll.control.rx_serial + 1;
    event.channel = request.channel;
    event.body = bytes; event.length = length; event.crc_valid = 1;
}

static void take(void)
{
    CHECK(mac_poll_take(&poll, &record) == MAC_POLL_OK);
    checksum = hash(&record, sizeof(record));
    CHECK(mac_poll_take(&poll, &record) == MAC_POLL_STATE);
    CHECK(hash(&record, sizeof(record)) == checksum);
}

static void close_poll(void)
{
    attempt = 0;
    while (poll.control.phase < MAC_POLL_DONE && !failure && attempt++ < 80) {
        if (poll.control.tx_issued) {
            action.kind = MAC_POLL_ACTION_TX; action.token = poll.control.tx_token;
            action.tx_cancel = poll.control.phase == MAC_POLL_DRAIN && tx.phase != MAC_TX_STOPPING;
            pump();
        } else if (action.kind == MAC_POLL_ACTION_CLOSE) {
            /* Synthetic confirmed ACK service, local IFS, complete drainage and
             * baseline RX handoff, not a fake hardware implementation. */
            now += 80;
            input(MAC_POLL_CLOSED);
            event.through = now;
            if (scenario == 26) event.through = poll.control.receive_end - 1;
            send();
            if (scenario == 26) break;
        } else
            tick();
    }
    CHECK(attempt < 80);
}

static void forward_response(void)
{
    memset(&association_event, 0, sizeof(association_event));
    association_event.kind = MAC_ASSOCIATION_FRAME;
    association_event.epoch = record.epoch;
    association_event.generation = association.generation;
    association_event.stamp = record.stamp;
    association_event.channel = request.channel;
    association_event.crc_valid = 1;
    association_event.body = record.body;
    association_event.length = record.length;
    CHECK((scenario < 52 ? mac_association_step(&association, now, &association_event, &observation)
           : mac_association_step_rx(&association, now, &association_event, &observation,
                                     MAC_RX_R22_ASSOCIATION_RESPONSE)) == MAC_ASSOCIATION_OK);
    CHECK(observation == (scenario == 4 ? MAC_ASSOCIATION_EXPIRED : MAC_ASSOCIATION_RESPONSE));
    CHECK(mac_association_take(&association, &association_record) == MAC_ASSOCIATION_OK);
    if (scenario != 4) {
        CHECK(association_record.short_address == 0x5678);
        CHECK(association_record.source_relation == (scenario == 3 || scenario == 53
              ? MAC_ASSOCIATION_SOURCE_UNBOUND : MAC_ASSOCIATION_SOURCE_MATCHED));
        CHECK(record.source_relation == association_record.source_relation);
        CHECK(association_record.stamp == record.stamp && record.body[0] == (scenario < 52 ? 0x73 : 0x33));
        CHECK(record.payload_offset == (scenario < 52 ? 21 : 23) && record.payload_length == 4);
    }
}

static void interrupted(void)
{
    prepare();
    while (tx.phase != MAC_TX_ACK_WAIT && !failure) pump();
    grant = action.token;
    memset(&source, 0, sizeof(source));
    source.kind = MAC_TX_EVENT_ACK;
    source.generation = tx.generation; source.retry = tx.retries; source.nb = tx.nb;
    now = source.stamp = tx.tx_end + 34;
    ack[0] = 0x12; ack[1] = 0; ack[2] = tx.frame[2];
    source.bytes = ack; source.length = 3;
    CHECK(mac_tx_step(&tx, now, &source, &radio_action) == MAC_TX_OK);
    CHECK(tx.outcome == MAC_TX_ACKED);
    event.source = source; event.crc_valid = 1; event.tx_result = MAC_TX_OK;
    if (scenario == 47) now++; /* Deliberate ordered-watermark violation. */
    input(MAC_POLL_CANCEL); send();
    event.kind = MAC_POLL_TX; event.token = grant; event.stamp = source.stamp;
    send(); /* Deliver the completed pump ONCE, never retimestamp/repeat it. */
    CHECK(poll.control.reason == MAC_POLL_CANCELLED && !poll.record.protocol);
    if (scenario == 47) {
        CHECK(poll.control.tx_issued);
        now = poll.control.stop_at; tick();
        CHECK(poll.control.phase == MAC_POLL_FAULT);
    }
}

static void corpus(void)
{
    CHECK(mac_poll_init(NULL) == MAC_POLL_INVALID);
    for (scenario = 0; scenario < 56 && !failure; scenario++) {
        setup();
        mode = scenario == 27 ? 1 : scenario == 28 ? 2 : scenario == 29 ? 3
             : scenario == 33 ? 4 : 0;
        if (scenario == 46 || scenario == 47)
            interrupted();
        else if (scenario == 30 || scenario == 31) {
            if (scenario == 31) tick();
            input(MAC_POLL_CANCEL); send();
        } else if (scenario == 32) {
            prepare();
            input(MAC_POLL_CANCEL); send();
        } else {
            request_ack();
            if (scenario == 5 || scenario == 27 || scenario == 28 || scenario == 29) {
                CHECK(poll.control.ready);
                CHECK(poll.record.protocol == (scenario == 28 ? MAC_POLL_NO_ACK
                      : scenario == 29 ? MAC_POLL_CHANNEL_ACCESS : MAC_POLL_NO_DATA));
                CHECK(tx.retries == (scenario == 27 ? 1 : scenario == 28 ? 3 : 0));
            } else if (scenario != 33 && scenario != 44 && scenario != 45) {
                CHECK(poll.control.phase == MAC_POLL_RECEIVE && tx.phase == MAC_TX_STOPPING);
                CHECK(poll.control.ack_end == event.source.stamp);
                /* Retire TX promptly while the independently prepared RX stays
                 * continuous, except explicit in-STOPPING delivery case0. */
                if (scenario != 0) pump();
                CHECK(scenario == 0 || tx.phase == MAC_TX_DONE);
                make_data(scenario == 1 || scenario == 41 ? 0 : 2);
                now = poll.control.ack_end + 100;
                if (scenario == 2 || scenario == 3 || scenario == 4 || scenario == 40) {
                    memcpy(bytes, response, sizeof(response)); length = sizeof(response);
                }
                if (scenario >= 52) {
                    memcpy(bytes, response_r22, sizeof(response_r22)); length = sizeof(response_r22);
                    if (scenario == 53) bytes[3] = bytes[4] = 0xff;
                }
                if (scenario == 4 || scenario == 7) now = poll.control.receive_end;
                if (scenario == 4) {
                    /* An independently chosen half-open metadata context ends
                     * exactly at D; poll must still retain/forward its command. */
                    CHECK(mac_association_init(&association, origin) == MAC_ASSOCIATION_OK);
                    association_request.lifetime = now - origin;
                    CHECK(mac_association_start(&association, &association_request, origin) == MAC_ASSOCIATION_OK);
                }
                if (scenario == 39) {
                    memset(bytes + length, 0x6b, 125u - length);
                    length = 125;
                }
                frame_event();
                if (scenario == 2) event.body = response; /* Real generic CODE decode. */
                if (scenario == 52) event.body = response_r22;
                switch (scenario) {
                case 6: case 26: case 42:
                    now = poll.control.receive_end; tick();
                    CHECK(!poll.control.ready && poll.control.timeout_pending);
                    if (scenario == 42) { input(MAC_POLL_FAILURE); send(); }
                    break;
                case 8:
                    now = poll.control.receive_end + 1; event.stamp = now;
                    send(); CHECK(action.observation == MAC_POLL_OBS_LATE && !poll.control.ready); break;
                case 9: case 15:
                    event.crc_valid = 0; send();
                    CHECK(action.observation == MAC_POLL_OBS_BAD_CRC);
                    if (scenario == 15) { send(); CHECK(action.observation == MAC_POLL_OBS_DUPLICATE); }
                    now++; frame_event(); send(); break;
                case 10:
                    event.length = 2; send();
                    CHECK(action.observation == MAC_POLL_OBS_MALFORMED);
                    now++; frame_event(); send(); break;
                case 11: case 12: case 13: case 14:
                    i = scenario == 11 ? 3 : scenario == 12 ? 13 : 5;
                    if (scenario == 14) event.channel = request.channel == 26 ? 11 : 26;
                    else bytes[i] ^= 1;
                    send(); CHECK(action.observation == MAC_POLL_OBS_FOREIGN);
                    if (scenario != 14) bytes[i] ^= 1;
                    now++; frame_event(); send(); break;
                case 16: case 17:
                    if (scenario == 16) event.epoch--;
                    else event.generation--;
                    send(); CHECK(action.observation == MAC_POLL_OBS_STALE);
                    now++; frame_event(); send(); break;
                case 18:
                    tick(); event.stamp = now - 1; send();
                    CHECK(poll.control.reason == MAC_POLL_ORDER_ERROR); break;
                case 19:
                    bytes[0] |= MAC_FLAG_SECURITY; send();
                    CHECK(action.observation == MAC_POLL_OBS_UNSUPPORTED); break;
                case 20:
                    memcpy(bytes, response, sizeof(response)); length = sizeof(response);
                    bytes[21] = 6; frame_event(); send();
                    CHECK(action.observation == MAC_POLL_OBS_UNSUPPORTED); break;
                case 21:
                    input(MAC_POLL_CANCEL); send(); break;
                case 22:
                    now = poll.control.deadline; tick(); break;
                case 23:
                    CHECK(!poll.control.steps); tick(); break; /* Real step consumption. */
                case 24:
                    input(MAC_POLL_FAILURE); send(); break;
                case 34:
                    now = poll.control.last - 1; tick(); break;
                case 43:
                    /* Already consumed pump token cannot replay an ACK. */
                    input(MAC_POLL_TX); event.token = 2; send();
                    now++; frame_event(); send(); break;
                case 48:
                    now = poll.control.receive_end; tick();
                    frame_event(); send();
                    CHECK(poll.control.reason == MAC_POLL_ORDER_ERROR); break;
                case 50:
                    tx.generation++; tick(); break;
                case 54:
                    bytes[0] ^= 2; bytes[3] = bytes[4] = 0xff;
                    send();
                    CHECK(action.observation == MAC_POLL_OBS_FOREIGN && !poll.control.ready);
                    bytes[0] ^= 2; bytes[3] = 0x34; bytes[4] = 0x12;
                    now++; frame_event();
                    bytes[13] ^= 1; send();
                    CHECK(action.observation == MAC_POLL_OBS_FOREIGN && !poll.control.ready);
                    bytes[13] ^= 1;
                    now++; frame_event(); send(); break;
                case 55:
                    checksum = hash(&poll, sizeof(poll));
                    CHECK(mac_poll_step_rx(&poll, &tx, now, &event, &action, 2) == MAC_POLL_INVALID);
                    CHECK(hash(&poll, sizeof(poll)) == checksum);
                    CHECK(mac_poll_step(&poll, &tx, now, &event, &action) == MAC_POLL_OK);
                    CHECK(action.observation == MAC_POLL_OBS_MALFORMED && !poll.control.ready);
                    now++; frame_event(); send(); break;
                default: send(); break;
                }
                if (poll.record.length) {
                    CHECK(poll.control.ready && poll.control.phase == MAC_POLL_DRAIN);
                    CHECK(poll.record.protocol == (scenario == 1 || scenario == 2 || scenario == 3
                          || scenario == 4 || scenario == 40 || scenario == 41 || scenario >= 52
                          ? MAC_POLL_NO_DATA : MAC_POLL_SUCCESS));
                    take();
                    CHECK(record.length == length && !memcmp(record.body, bytes, length));
                    for (i = length; i < 125; i++) CHECK(record.body[i] == 0);
                    memset(bytes, 0, sizeof(bytes));
                    CHECK(hash(&record, sizeof(record)) == checksum);
                    if (record.cause == MAC_POLL_COMMAND) forward_response();
                    if (scenario == 25 || scenario == 49) {
                        if (scenario == 49) {
                            input(MAC_POLL_CLOSED); event.token--; event.through = now; send();
                            CHECK(!poll.control.closed && poll.control.phase == MAC_POLL_DRAIN);
                        }
                        now = poll.control.stop_at; tick();
                        CHECK(poll.control.phase == MAC_POLL_FAULT && record.protocol == MAC_POLL_SUCCESS);
                    }
                }
            }
        }
        if (poll.control.phase < MAC_POLL_DONE) close_poll();
        if (scenario == 26) { now = poll.control.stop_at; tick(); }
        CHECK(poll.control.phase == MAC_POLL_DONE || poll.control.phase == MAC_POLL_FAULT);
        if (scenario == 51) {
            checksum = hash(&poll, sizeof(poll));
            now++; frame_event(); send();
            CHECK(hash(&poll, sizeof(poll)) == checksum);
        }
        if (!poll.control.taken) take();
        if (poll.control.reason)
            CHECK(record.protocol == MAC_POLL_NO_CONFIRM || record.length);
        checksum = hash(&poll, sizeof(poll));
        if (poll.control.phase == MAC_POLL_FAULT) {
            CHECK(mac_poll_release(&poll, &tx) == MAC_POLL_STATE);
            CHECK(hash(&poll, sizeof(poll)) == checksum);
        } else {
            CHECK(tx.next_dsn == (poll.control.submitted ? 0 : 0xff));
            CHECK(mac_poll_release(&poll, &tx) == MAC_POLL_OK);
            CHECK(tx.phase == MAC_TX_IDLE && poll.control.phase == MAC_POLL_IDLE);
            if (scenario == 36) {
                CHECK(mac_poll_start(&poll, &tx, &request, now) == MAC_POLL_OK);
                tick(); input(MAC_POLL_PREPARED); send();
                CHECK(tx.next_dsn == 1 && tx.generation == 2 && tx.frame[2] == 0);
                input(MAC_POLL_CANCEL); send(); close_poll(); take();
                CHECK(mac_poll_release(&poll, &tx) == MAC_POLL_OK);
            }
        }
    }
}

