faronov/cc2530-zigbee/tests/test_mac_poll.c
#ifdef CC2530_HOST_TEST
#include <stdio.h>
#include <stdlib.h>
static void native(void)
{
    mac_poll_t saved, other;
    mac_poll_record_t old;
    mac_poll_action_t before;
    mac_tx_t saved_tx;
    unsigned n;
    uint8_t *exact;
    scenario = 0;
    for (n = 0; n <= 126 && !failure; n++) {
        setup(); mode = 0; request_ack(); pump(); make_data(2);
        exact = malloc(n ? n : 1); CHECK(exact != NULL);
        memset(exact, 0x6b, n); memcpy(exact, bytes, n < length ? n : length);
        now++; frame_event(); event.body = exact; event.length = (uint16_t)n;
        send(); free(exact);
        CHECK((poll.record.protocol == MAC_POLL_SUCCESS) == (n > 21 && n <= 125));
    }
    setup(); saved = poll; saved_tx = tx; before = action; old = record;
    CHECK(mac_poll_start(NULL, &tx, &request, now) == MAC_POLL_INVALID);
    CHECK(mac_poll_step(&poll, &tx, now, NULL, NULL) == MAC_POLL_INVALID);
    event.kind = 0;
    CHECK(mac_poll_step(&poll, &tx, now, &event, &action) == MAC_POLL_INVALID);
    CHECK(!memcmp(&poll, &saved, sizeof(poll)) && !memcmp(&tx, &saved_tx, sizeof(tx)));
    CHECK(!memcmp(&action, &before, sizeof(action)) && !memcmp(&record, &old, sizeof(record)));
    CHECK(mac_poll_take(NULL, &record) == MAC_POLL_INVALID);
    CHECK(mac_poll_release(NULL, &tx) == MAC_POLL_INVALID);
    CHECK(mac_poll_init(&poll) == MAC_POLL_OK);
    for (n = 0; n < 256; n++) {
        request.channel = (uint8_t)n; saved = poll;
        if (n < 11 || n > 26) {
            CHECK(mac_poll_start(&poll, &tx, &request, now) == MAC_POLL_INVALID);
            CHECK(!memcmp(&poll, &saved, sizeof(poll)));
        }
    }
    request.channel = 11;
    poll.control.generation = UINT32_MAX; saved = poll;
    CHECK(mac_poll_start(&poll, &tx, &request, now) == MAC_POLL_LIMIT);
    CHECK(!memcmp(&poll, &saved, sizeof(poll)));

    /* Rejected calls on another context must not leak staged state or inputs.
     * Inactive receipt bytes are independent of the staged control prefix. */
    setup();
    for (n = 0; n < sizeof(poll.record.body); n++)
        poll.record.body[n] = (uint8_t)(n ^ 0xa5u);
    old = poll.record;
    tick();
    saved = poll; saved_tx = tx; before = action;
    CHECK(mac_poll_init(&other) == MAC_POLL_OK);
    input(MAC_POLL_CANCEL);
    CHECK(mac_poll_step(&other, &tx, now, &event, &action) == MAC_POLL_STATE);
    CHECK(!memcmp(&action, &before, sizeof(action)));
    request.channel = 0;
    CHECK(mac_poll_start(&other, &tx, &request, now) == MAC_POLL_INVALID);
    request.channel = 11;
    tick();
    saved.control.steps--;
    CHECK(!memcmp(&poll, &saved, sizeof(poll)));
    CHECK(!memcmp(&poll.record, &old, sizeof(old)));
    CHECK(!memcmp(&tx, &saved_tx, sizeof(tx)));

    setup(); mode = 0; request_ack(); pump(); make_data(2);
    now++; frame_event(); send(); take();
    saved = poll; saved_tx = tx; old = record; before = action;
    CHECK(mac_poll_take(&other, &record) == MAC_POLL_STATE);
    CHECK(mac_poll_step(&other, &tx, now, NULL, &action) == MAC_POLL_STATE);
    CHECK(!memcmp(&action, &before, sizeof(action)));
    tick();
    saved.control.stop_steps--;
    CHECK(!memcmp(&poll, &saved, sizeof(poll)));
    CHECK(!memcmp(&record, &old, sizeof(record)));
    CHECK(!memcmp(&tx, &saved_tx, sizeof(tx)));

    setup(); saved = poll; saved_tx = tx; before = action;
    for (n = 2; n < 256; n++) {
        CHECK(mac_poll_step_rx(&poll, &tx, now, NULL, &action, (uint8_t)n) == MAC_POLL_INVALID);
        CHECK(!memcmp(&poll, &saved, sizeof(poll)) && !memcmp(&tx, &saved_tx, sizeof(tx)));
        CHECK(!memcmp(&action, &before, sizeof(action)));
    }
    scenario = 52;
    setup(); mode = 0; request_ack(); pump(); make_data(2);
    header.flags &= (uint8_t)~MAC_FLAG_PAN_COMPRESSION;
    header.destination_pan = 0xffff;
    CHECK(mac_frame_encode(&header, ack, 2, bytes, sizeof(bytes), &length) == MAC_CODEC_OK);
    now++; frame_event(); send();
    CHECK(action.observation == MAC_POLL_OBS_FOREIGN && !poll.control.ready && !poll.record.length);
    for (n = 0; n <= 126 && !failure; n++) {
        setup(); mode = 0; request_ack(); pump();
        exact = malloc(n ? n : 1); CHECK(exact != NULL);
        memset(exact, 0x6b, n);
        memcpy(exact, response_r22, n < sizeof(response_r22) ? n : sizeof(response_r22));
        now++; frame_event(); event.body = exact; event.length = (uint16_t)n;
        send(); free(exact);
        CHECK((poll.record.cause == MAC_POLL_COMMAND) == (n == sizeof(response_r22)));
    }
    /* Alternate decoded-frame -> encoder-header -> decoded-frame lifetimes,
     * and FRAME -> output -> rejected input, without disturbing a receipt or
     * reinitializing either world's live owner. All lower calls are genuine. */
    {
        mac_tx_t other_tx;
        mac_poll_request_t other_request;
        mac_poll_event_t other_event;
        mac_poll_action_t other_action, saved_action;
        mac_poll_record_t other_record;
        mac_frame_info_t decoded;
        scenario = 0;
        setup(); mode = 0; request_ack(); pump(); make_data(2);
        now++; frame_event(); send(); take();
        saved = poll; saved_tx = tx; old = record; before = action;
        other_request = request;
        other_request.epoch = 0x87654321UL;
        other_request.pan = 0x4567;
        CHECK(mac_tx_init(&other_tx, 0x5a, 0) == MAC_TX_OK);
        CHECK(mac_poll_init(&other) == MAC_POLL_OK);
        CHECK(mac_poll_start(&other, &other_tx, &other_request, 0) == MAC_POLL_OK);
        CHECK(mac_frame_decode(other.control.outgoing, other.control.outgoing_length, &decoded) == MAC_CODEC_OK);
        CHECK(decoded.header.version == 0 && decoded.header.sequence == 0);
        CHECK(decoded.header.destination_pan == 0x4567 && decoded.header.source_pan == 0x4567);
        CHECK(other.control.outgoing[decoded.payload_offset] == MAC_COMMAND_DATA_REQUEST);
        memset(&other_event, 0, sizeof(other_event));
        other_event.epoch = other_request.epoch; other_event.generation = other.control.generation;
        other_event.kind = MAC_POLL_CANCEL;
        CHECK(mac_poll_step(&other, &other_tx, 0, &other_event, &other_action) == MAC_POLL_OK);
        CHECK(other_action.kind == MAC_POLL_ACTION_CLOSE);
        other_event.kind = MAC_POLL_CLOSED; other_event.token = other_action.token;
        CHECK(mac_poll_step(&other, &other_tx, 0, &other_event, &other_action) == MAC_POLL_OK);
        CHECK(other.control.phase == MAC_POLL_DONE && other_action.kind == MAC_POLL_ACTION_NONE);
        saved_action = other_action;
        other_event.kind = 255;
        CHECK(mac_poll_step(&other, &other_tx, 0, &other_event, &other_action) == MAC_POLL_INVALID);
        CHECK(!memcmp(&other_action, &saved_action, sizeof(other_action)));
        CHECK(mac_poll_take(&other, &other_record) == MAC_POLL_OK);
        CHECK(mac_poll_release(&other, &other_tx) == MAC_POLL_OK);
        CHECK(!memcmp(&poll, &saved, sizeof(poll)) && !memcmp(&tx, &saved_tx, sizeof(tx)));
        CHECK(!memcmp(&record, &old, sizeof(record)) && !memcmp(&action, &before, sizeof(action)));
        close_poll();
        CHECK(!memcmp(&poll.record, &saved.record, sizeof(poll.record)));
        CHECK(mac_poll_release(&poll, &tx) == MAC_POLL_OK);
    }
}
int main(void)
{
    corpus();
    if (!failure) native();
    if (failure) { fprintf(stderr, "mac_poll scenario %u failed line %u\n", scenario, failure); return 1; }
    puts("MAC poll: 56 shared synthetic scenarios + legacy/R22 exact/atomic cases PASS");
    return 0;
}
#else
volatile __xdata __at(0x1e00) uint8_t mac_poll_result[8];
void main(void)
{
    corpus();
    mac_poll_result[0] = 'P'; mac_poll_result[1] = 'O';
    mac_poll_result[2] = 'L'; mac_poll_result[3] = '1';
    mac_poll_result[4] = 1; mac_poll_result[5] = 8;
    mac_poll_result[6] = (uint8_t)failure;
    mac_poll_result[7] = (uint8_t)(failure >> 8);
    __asm
        .globl _mac_poll_done
    _mac_poll_done:
        nop
    __endasm;
    for (;;) {}
}
#endif
